/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_pare_cmd.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: joowpark <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/01/05 16:49:27 by joowpark          #+#    #+#             */
/*   Updated: 2023/01/05 17:15:37 by joowpark         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "types.h"




// 4. big 노드를 돌면서 here_doc을 돌면서 실행 (line 을 small_node에 저장) 있으면 실행  big_node를 돌면서 파싱함.
// 5. 이제 big

int	parse_cmd()
{
	// 1. && || 으로 나누기
	// 2. 나눈 것을 big_node 에 저장 
	// 3  | << >> < > 으로 나누기 node로 분활
}
